In [6]:
# https://www.analyticsvidhya.com/blog/2021/05/one-stop-shop-for-connecting-snowflake-to-python/
#!pip install snowflake-connector-python[pandas]
#pip install snowflake-sqlalchemy

In [28]:
import snowflake.connector
import pandas as pd
import numpy as np
ctx = snowflake.connector.connect(
    account = 'xb05962.australia-east.azure',
    user = 'Ronnyc',
    password = 'Ronchi1989',
    warehouse = 'FINANCE',
    database = 'FINANCE_TEAM',
    schema = 'PUBLIC'
)
cur = ctx.cursor()

In [29]:
sql = "select * from xero"
x  = cur.execute(sql)
m = cur.fetchall()

pd.DataFrame(m)

,0,1,2,3,4,5,6,7,8
0,2021-10-31,LCA Elizabeth Pty Limited,Revenue,41000,Earned Revenue,0,154984,0,626644
1,2021-10-31,LCA Elizabeth Pty Limited,Revenue,81000,Interest Income,0,1,0,3
2,2021-10-31,LCA Elizabeth Pty Limited,Revenue,82000,Lease Incentive,0,3611,0,14444
3,2021-10-31,LCA Elizabeth Pty Limited,Revenue,41010,Sales Commission,0,12,0,114

In [41]:
cur.execute(
        "CREATE OR REPLACE TABLE "
        "test_table(col1 integer, col2 string)"
)

In [11]:
cur.execute(
        "CREATE OR REPLACE TABLE "
        "test_table(col1 varchar(10), col2 varchar(20))")

In [13]:
cur.execute (
  "CREATE OR REPLACE TABLE "  
  "test_table(Company varchar(100), AcctType varchar(50), Acct varchar(100))")

In [32]:
cur.execute(
        "INSERT INTO test_table(col1, col2) VALUES " + 
        "    (123, 'test string1'), " + 
        "    (456, 'test string2')")

In [33]:
sql = "select * from test_table"
x  = cur.execute(sql)
m = cur.fetchall()

pd.DataFrame(m)

     0             1
0  123  test string1
1  456  test string2

In [47]:
sql = "delete from xero2"
x  = cur.execute(sql)

In [60]:
sql = "select * from xero3"
x  = cur.execute(sql)
df = pd.DataFrame(cur.fetchall())

In [62]:
df.shape

(15303, 3)

In [63]:
df.head(5)

                           0         1                 2
0  LCA Elizabeth Pty Limited   Revenue    Earned Revenue
1  LCA Elizabeth Pty Limited   Revenue   Interest Income
2  LCA Elizabeth Pty Limited   Revenue   Lease Incentive
3  LCA Elizabeth Pty Limited   Revenue  Sales Commission
4  LCA Elizabeth Pty Limited  Expenses     Opening Stock

# Example to load csv to table in snowflake via python, esp date format
https://docs.snowflake.com/en/user-guide/python-connector-example.html#creating-tables-and-inserting-data

In [125]:
import snowflake.connector
import pandas as pd
import numpy as np
ctx = snowflake.connector.connect(
    account = 'xb05962.australia-east.azure',
    user = 'Ronnyc',
    password = 'Ronchi1989',
    warehouse = 'FINANCE',
    database = 'FINANCE_TEAM',
    schema = 'PUBLIC'
)
cur = ctx.cursor()

In [126]:
# create table with date
cur.execute ("alter session set DATE_INPUT_FORMAT = 'DD/MM/YYYY'")
cur.execute (
            "create or replace table "
            "mydate(Date date)"
            )

In [127]:
### Load csv files start with test*
cur.execute("PUT file:///tmp/Book* @%mydate")
cur.execute("COPY INTO mydate")

In [128]:
# check the results 

sql = "select * from mydate"
x  = cur.execute(sql)
m = cur.fetchall()

pd.DataFrame(m)

             0
0   2021-01-01
1   2021-01-02
2   2021-01-03
3   2021-01-04
4   2021-01-05
5   2021-01-06
6   2021-01-07
7   2021-01-08
8   2021-01-09
9   2021-01-10
10  2021-01-11
11  2021-01-12
12  2021-01-13
13  2021-01-14
14  2021-01-15

# LOADING XERO

In Snowflake, you need to do alter session to make sure the date format the same with your csv input format. 
In this case, you will run alter session set DATE_INPUT_FORMAT = 'DD/MM/YYYY' so your csv will load properly.

In [2]:
import snowflake.connector
import pandas as pd
import numpy as np
ctx = snowflake.connector.connect(
    account = 'xb05962.australia-east.azure',
    user = 'Ronnyc',
    password = 'Ronchi1989',
    warehouse = 'FINANCE',
    database = 'FINANCE_TEAM',
    schema = 'PUBLIC'
)
cur = ctx.cursor()

In [3]:

# create table with date
cur.execute ("alter session set DATE_INPUT_FORMAT = 'DD/MM/YYYY'")
cur.execute (
            "create or replace table "
            "Xero(Date date, Organisation varchar(100), Section varchar(50), AcctCode varchar(50), AcctName varchar(100), Dr number(10,0), Cr number(10,0), YTD_Dr number(10,0), YTD_Cr number(10,0))"
            )

In [157]:
# normal insert
#cur.execute("insert into mydate values " + "('08/24/21')")

In [6]:
### Load csv files start with test*
cur.execute("PUT file:///tmp/Test* @%Xero")
cur.execute("COPY INTO Xero")

ProgrammingError: 100080 (22000): Number of columns in file (8) does not match that of the corresponding table (9), use file format option error_on_column_count_mismatch=false to ignore this error
  File '@XERO/Test.csv.gz', line 2, character 1
  Row 1 starts at line 1, column "XERO"["YTD_DR":8]
  If you would like to continue loading when an error is encountered, use other values such as 'SKIP_FILE' or 'CONTINUE' for the ON_ERROR option. For more information on loading options, please run 'info loading_data' in a SQL client.

In [5]:
# check the results 

sql = "select * from xero"
x  = cur.execute(sql)
m = cur.fetchall()

pd.DataFrame(m)

,0,1,2,3,4,5,6,7,8
0,2021-10-31,LCA Elizabeth Pty Limited,Revenue,41000,Earned Revenue,NaN,154984.0,NaN,626644.0
1,2021-10-31,LCA Elizabeth Pty Limited,Revenue,81000,Interest Income,NaN,1.0,NaN,3.0
2,2021-10-31,LCA Elizabeth Pty Limited,Revenue,82000,Lease Incentive,NaN,3611.0,NaN,14444.0
3,2021-10-31,LCA Elizabeth Pty Limited,Revenue,41010,Sales Commission,NaN,12.0,NaN,114.0
4,2021-10-31,LCA Elizabeth Pty Limited,Expenses,50500,Opening Stock,39762.0,NaN,192103.0,NaN
...,...,...,...,...,...,...,...,...,...
15298,2021-10-31,LCA Roselands Pty Ltd,Liabilities,21410,Superannuation Payable,1191.0,NaN,NaN,1133.0
15299,2021-10-31,LCA Roselands Pty Ltd,Liabilities,21200,Trade Creditors,NaN,28168.0,NaN,139115.0
15300,2021-10-31,LCA Roselands Pty Ltd,Equity,31000,Issued Shares,NaN,0.0,NaN,100.0
15301,2021-10-31,LCA Roselands Pty Ltd,Equity,38000,Retained Earnings,NaN,0.0,29316.0,NaN
15302,2021-10-31,LCA Roselands Pty Ltd,Equity,31001,Tax Benefits Carried Forward,NaN,0.0,NaN,19508.0

In [ ]:
Date;XeroOrganisation,SectionName;AccountCode;AccountName;Debit;Credit;YTD Debit;YTD Credit


# create table with date
cur.execute ("alter session set DATE_INPUT_FORMAT = 'MM/DD/YYYY'")
cur.execute (
            "create or replace table "
            "xero(date date)"
            )